Feature: Възлагане на задача на участник в проект

  Scenario: Задача се възлага на участник правилно
    Given Потребителят е на екрана за възлагане на задача
    And Потребителят има задача "Task1"
    And Потребителят има участник с имена "Иван" "Иванов"
    When Потребителят избира задача "Task1"
    And Потребителят избира участник "Иван" "Иванов"
    And Потребителят натиска бутона и възлага задачата на участника
    Then Задачата е била възложена на избрания участник
    And Броя на задачите на участника е "1"