Feature: Смяна на статус на задача
    
  Scenario: Смяна на статус на задача
    Given Потребителят има задача с име "Task1"
    And Задачата "Task1" има статус "NEW"
    When Потребителят избира задача с име "Task1"
    And Променя статуса на "IN_PROGRESS"
    Then Потребителят получава съобщение "Status changed successfully"

  Scenario: Статуса на задача не може да бъде променен ако е завършена
    Given Потребителят има задача с име "Task2"
    And Задачата "Task2" има статус "DONE"
    When Потребителят избира задача с име "Task2"
    And Променя статуса на "IN_PROGRESS"
    Then Потребителят получава съобщение "Task is done, unable to change status"
    
	Scenario: Логърът получава съобщение при промяна на статуса на задача
    Given Потребителят има задача с име "Task3"
    And Задачата "Task3" има статус "NEW"
    And Логърът няма запазени съобщения
    When Потребителят избира задача с име "Task3"
    And Променя статуса на "IN_PROGRESS"
    Then Броя на съобщенията в логъра е "1"